# 207. Дано натуральне число а (a <100). Напишіть програму, що виводить на екран кількість цифр
# в цьому числі і суму цих цифр

a = 65
# a = 8
# a = 13
# a = 99
print(len(str(a)))
print(sum(int(a) for a in (str(a))))
